betfair/templates/aus/BFExchangeService.placeBets.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:placeBets>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<bets>
<ns2:PlaceBets>
<asianLineId>0</asianLineId>
<betType>B</betType>
<betCategoryType>E</betCategoryType>
<betPersistenceType>NONE</betPersistenceType>
<marketId>0</marketId>
<price>0.0</price>
<selectionId>0</selectionId>
<size>0.0</size>
<bspLiability>0.0</bspLiability>
</ns2:PlaceBets>
<ns2:PlaceBets>
<asianLineId>0</asianLineId>
<betType>B</betType>
<betCategoryType>E</betCategoryType>
<betPersistenceType>NONE</betPersistenceType>
<marketId>0</marketId>
<price>0.0</price>
<selectionId>0</selectionId>
<size>0.0</size>
<bspLiability>0.0</bspLiability>
</ns2:PlaceBets>
</bets>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:placeBets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
